export const companyInfoMock = {
  registry: {
    code: "23744453",
    location: "Україна, 02140, місто Київ, ВУЛИЦЯ ГРИШКА, будинок 7",
    email: "info@ua.mcd.com",
    activities: [
      {
        code: "10.52",
        name: "Виробництво морозива",
        isPrimary: false,
      },
      {
        code: "11.07",
        name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
        isPrimary: false,
      },
      {
        code: "46.39",
        name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
        isPrimary: false,
      },
      {
        code: "85.32",
        name: "Професійно-технічна освіта",
        isPrimary: false,
      },
      {
        code: "47.19",
        name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
        isPrimary: false,
      },
      {
        code: "56.10",
        name: "Діяльність ресторанів, надання послуг мобільного харчування",
        isPrimary: true,
      },
      {
        code: "68.20",
        name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
        isPrimary: false,
      },
    ],
    status: "зареєстровано",
    phones: ["380502300909", "380662300900"],
    capital: 901801008.99,
    heads: [
      {
        name: "БАДРІТДІНОВА ЮЛІЯ ІВАНІВНА",
        role: "керівник",
        restriction: "",
        type: "head",
      },
    ],
    registrations: [
      {
        code: "37507880",
        name: "ДЕРЖАВНА СЛУЖБА СТАТИСТИКИ УКРАЇНИ",
        type: 4000,
        startDate: "1995-12-25",
      },
      {
        code: "44082145",
        name: "ЦЕНТРАЛЬНЕ МІЖРЕГІОНАЛЬНЕ УПРАВЛІННЯ ДПС ПО РОБОТІ З ВЕЛИКИМИ ПЛАТНИКАМИ ПОДАТКІВ",
        description: "Реєстр платників податків",
        type: "taxoffice",
        startDate: "1997-04-10",
      },
      {
        code: "44082145",
        name: "ЦЕНТРАЛЬНЕ МІЖРЕГІОНАЛЬНЕ УПРАВЛІННЯ ДПС ПО РОБОТІ З ВЕЛИКИМИ ПЛАТНИКАМИ ПОДАТКІВ",
        description: "Реєстр платників єдиного внеску",
        type: "singletax",
        startDate: "2002-07-01",
      },
    ],
    beneficiaries: [
      {
        name: 'КОМПАНІЯ "ЕМСІДІ ЮРОП ЛІМІТЕД"',
        role: "засновник",
        amount: 901801008.99,
        location:
          "Сполучене Королівство, КОРДІ ХАУС, 91, КЕРТЕН РОУД, ЛОНДОН, АНГЛІЯ, EC2A 3BS",
        amountPercent: 100,
      },
    ],
    branches: [
      {
        code: "26454371",
        role: 5,
        address: {
          zip: "79053",
          country: "Україна",
          address:
            "Україна, 79053, Львівська обл., місто Львів, ВУЛИЦЯ ВОЛОДИМИРА ВЕЛИКОГО, будинок 24-А",
          parts: {
            atu: "Львівська обл., місто Львів",
            street: "ВУЛИЦЯ ВОЛОДИМИРА ВЕЛИКОГО",
            house: "24-А",
            houseType: "будинок",
            atuCode: "4610136900",
          },
        },
        name: 'ФІЛІЯ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У МІСТІ ЛЬВІВ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0322-976874"],
          fax: "8-0322-976875",
          email: "0035@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "24008992",
        role: 5,
        address: {
          zip: "40030",
          country: "Україна",
          address:
            "Україна, 40030, Сумська обл., місто Суми, ПОКРОВСЬКА ПЛОЩА, будинок 15-А",
          parts: {
            atu: "Сумська обл., місто Суми",
            street: "ПОКРОВСЬКА ПЛОЩА",
            house: "15-А",
            houseType: "будинок",
            atuCode: "5910136600",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ СУМИ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0542-214442"],
          fax: "8-0542-214443",
          email: "0024@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "25728607",
        role: 5,
        address: {
          zip: "18001",
          country: "Україна",
          address:
            "Україна, 18001, Черкаська обл., місто Черкаси, ВУЛИЦЯ СМІЛЯНСЬКА, будинок 31",
          parts: {
            atu: "Черкаська обл., місто Черкаси",
            street: "ВУЛИЦЯ СМІЛЯНСЬКА",
            house: "31",
            houseType: "будинок",
            atuCode: "7110136400",
          },
        },
        name: 'РЕСТОРАН "МАКДОНАЛЬДЗ-СМІЛЯНСЬКА" ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ ЧЕРКАСИ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0472-545235"],
          fax: "8-0472-545335",
          email: "0014@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "25571229",
        role: 5,
        address: {
          zip: "14000",
          country: "Україна",
          address:
            "Україна, 14000, Чернігівська обл., місто Чернігів, ВУЛИЦЯ КІРПОНОСА, будинок 34",
          parts: {
            atu: "Чернігівська обл., місто Чернігів",
            street: "ВУЛИЦЯ КІРПОНОСА",
            house: "34",
            houseType: "будинок",
            atuCode: "7410136600",
          },
        },
        name: 'РЕСТОРАН "МАКДОНАЛЬДЗ" ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ ЧЕРНІГІВ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0462-102018"],
          fax: "8-0462-101019",
          email: "0016@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "25765034",
        role: 5,
        address: {
          zip: "69032",
          country: "Україна",
          address:
            "Україна, 69032, Запорізька обл., місто Запоріжжя, ПРОСПЕКТ СОБОРНИЙ, будинок 218-А",
          parts: {
            atu: "Запорізька обл., місто Запоріжжя",
            street: "ПРОСПЕКТ СОБОРНИЙ",
            house: "218-А",
            houseType: "будинок",
            atuCode: "2310136900",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У МІСТІ ЗАПОРІЖЖЯ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0612-128445"],
          fax: "8-0612-128444",
          email: "0028@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "25771856",
        role: 5,
        address: {
          zip: "50027",
          country: "Україна",
          address:
            "Україна, 50027, Дніпропетровська обл., місто Кривий Ріг, ПРОСПЕКТ ГАГАРІНА, будинок 2",
          parts: {
            atu: "Дніпропетровська обл., місто Кривий Ріг",
            street: "ПРОСПЕКТ ГАГАРІНА",
            house: "2",
            houseType: "будинок",
            atuCode: "1211036300",
          },
        },
        name: 'РЕСТОРАН "МАКДОНАЛЬДЗ - 95-Й КВАРТАЛ" ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ КРИВИЙ РІГ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0564-400913"],
          fax: "8-0564-400914",
          email: "0031@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "25515923",
        role: 5,
        address: {
          zip: "49070",
          country: "Україна",
          address:
            "Україна, 49070, Дніпропетровська обл., місто Дніпро, ПЛОЩА СТАРОМОСТОВА, будинок 5",
          parts: {
            atu: "Дніпропетровська обл., місто Дніпро",
            street: "ПЛОЩА СТАРОМОСТОВА",
            house: "5",
            houseType: "будинок",
            atuCode: "1210137500",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У МІСТІ ДНІПРО',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-056-3704249"],
          fax: "8-056-3704248",
          email: "008@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "23406288",
        role: 5,
        address: {
          zip: "54001",
          country: "Україна",
          address:
            "Україна, 54001, Миколаївська обл., місто Миколаїв, ВУЛИЦЯ АДМІРАЛА МАКАРОВА, будинок 43",
          parts: {
            atu: "Миколаївська обл., місто Миколаїв",
            street: "ВУЛИЦЯ АДМІРАЛА МАКАРОВА",
            house: "43",
            houseType: "будинок",
            atuCode: "4810137200",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ МИКОЛАЇВ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0512-474037"],
          fax: "8-0512-473707",
          email: "0034@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "26471352",
        role: 5,
        address: {
          zip: "65111",
          country: "Україна",
          address:
            "Україна, 65111, Одеська обл., місто Одеса, ВУЛИЦЯ ДОБРОВОЛЬСЬКОГО, будинок 116-А",
          parts: {
            atu: "Одеська обл., місто Одеса",
            street: "ВУЛИЦЯ ДОБРОВОЛЬСЬКОГО",
            house: "116-А",
            houseType: "будинок",
            atuCode: "5110137600",
          },
        },
        name: 'ФІЛІЯ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ ОДЕСА',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0487-580703"],
          fax: "8-0487-580723",
          email: "0013@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "25511670",
        role: 5,
        address: {
          zip: "21000",
          country: "Україна",
          address:
            "Україна, 21000, Вінницька обл., місто Вінниця, ВУЛИЦЯ СОБОРНА, будинок 51-А",
          parts: {
            atu: "Вінницька обл., місто Вінниця",
            street: "ВУЛИЦЯ СОБОРНА",
            house: "51-А",
            houseType: "будинок",
            atuCode: "0510100000",
          },
        },
        name: 'ВІДОСОБЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ ВІННИЦЯ - ЗАКЛАД ГРОМАДСЬКОГО ХАРЧУВАННЯ "МАКДОНАЛЬДЗ-СОБОРНА"',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["8-0432-520450"],
          fax: "8-0432-520440",
          email: "0038@mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "24271672",
        role: 5,
        address: {
          zip: "61011",
          country: "Україна",
          address:
            "Україна, 61011, Харківська обл., місто Харків, вул.Суздальські Ряди, будинок 9",
          parts: {
            atu: "Харківська обл., місто Харків",
            street: "вул.Суздальські Ряди",
            house: "9",
            houseType: "будинок",
            atuCode: "63120270010877312",
          },
        },
        name: "Відокремлений підрозділ Підприємства з іноземними інвестиціями “МакДональдз Юкрейн Лтд” в місті Харкові",
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+38(050)-230-09-09", "+38(066)-230-09-00"],
          email: "info@ua.mcd.com",
          webPage: "www.mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "35617946",
        role: 5,
        address: {
          zip: "39631",
          country: "Україна",
          address:
            "Україна, 39631, Полтавська обл., місто Кременчук, ВУЛИЦЯ КИЇВСЬКА, будинок 6",
          parts: {
            atu: "Полтавська обл., місто Кременчук",
            street: "ВУЛИЦЯ КИЇВСЬКА",
            house: "6",
            houseType: "будинок",
            atuCode: "5310436100",
          },
        },
        name: 'ВІДОСОБЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ КРЕМЕНЧУЦІ ЗАКУСОЧНА "МАКДОНАЛЬДЗ-ФОНТАН"',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: [],
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "36058139",
        role: 5,
        address: {
          zip: "10001",
          country: "Україна",
          address:
            "Україна, 10001, Житомирська обл., місто Житомир, ВУЛИЦЯ КИЇВСЬКА, будинок 77",
          parts: {
            atu: "Житомирська обл., місто Житомир",
            street: "ВУЛИЦЯ КИЇВСЬКА",
            house: "77",
            houseType: "будинок",
            atuCode: "1810136600",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В М.ЖИТОМИР ЗАКУСОЧНА "МАКДОНАЛЬДЗ ГЛОБАЛ-ЖИТОМИР"',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380503867151", "+380442300900"],
          fax: "+380442300901",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "36058144",
        role: 5,
        address: {
          zip: "36000",
          country: "Україна",
          address:
            "Україна, 36000, Полтавська обл., місто Полтава, ВУЛИЦЯ ЄВРОПЕЙСЬКА, будинок 187-А",
          parts: {
            atu: "Полтавська обл., місто Полтава",
            street: "ВУЛИЦЯ ЄВРОПЕЙСЬКА",
            house: "187-А",
            houseType: "будинок",
            atuCode: "5310137000",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В МІСТІ ПОЛТАВА',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380503868611", "+380442300900"],
          fax: "+380442300901",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "36272873",
        role: 5,
        address: {
          zip: "36000",
          country: "Україна",
          address:
            "Україна, 36000, Дніпропетровська обл., Дніпровський р-н, селище міського типу Слобожанське, ВУЛИЦЯ НИЖНЬОДНІПРОВСЬКА, будинок 17",
          parts: {
            atu: "Дніпропетровська обл., Дніпровський р-н, селище міського типу Слобожанське",
            street: "ВУЛИЦЯ НИЖНЬОДНІПРОВСЬКА",
            house: "17",
            houseType: "будинок",
            atuCode: "1221455800",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У ДНІПРОПЕТРОВСЬКІЙ ОБЛАСТІ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["80442300903", "80442300900"],
          fax: "80442300901",
          email: "info@ua.mcd.com",
          webPage: "www.mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "38265712",
        role: 5,
        address: {
          zip: "33028",
          country: "Україна",
          address:
            "Україна, 33028, Рівненська обл., місто Рівне, ВУЛИЦЯ КОРОЛЕНКА, будинок 1",
          parts: {
            atu: "Рівненська обл., місто Рівне",
            street: "ВУЛИЦЯ КОРОЛЕНКА",
            house: "1",
            houseType: "будинок",
            atuCode: "5610100000",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У М. РІВНЕ - ЗАКУСОЧНА "МАКДОНАЛЬДЗ - КОРОЛЕНКА"',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["0503860913"],
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "38934582",
        role: 5,
        address: {
          zip: "73000",
          country: "Україна",
          address:
            "Україна, 73000, Херсонська обл., місто Херсон, ВУЛИЦЯ ЗАЛАЕГЕРСЕГ, будинок 18",
          parts: {
            atu: "Херсонська обл., місто Херсон",
            street: "ВУЛИЦЯ ЗАЛАЕГЕРСЕГ",
            house: "18",
            houseType: "будинок",
            atuCode: "6510136300",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У М. ХЕРСОН',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380442300900", "+380442300903"],
          fax: "+380442300901",
          email: "info@ua.mcd.com",
          webPage: "www.mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "39013221",
        role: 5,
        address: {
          zip: "08300",
          country: "Україна",
          address:
            "Україна, 08300, Київська обл., місто Бориспіль, ВУЛИЦЯ КИЇВСЬКИЙ ШЛЯХ, будинок 67",
          parts: {
            atu: "Київська обл., місто Бориспіль",
            street: "ВУЛИЦЯ КИЇВСЬКИЙ ШЛЯХ",
            house: "67",
            houseType: "будинок",
            atuCode: "3210500000",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У М. БОРИСПІЛЬ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380442300900", "+380442300903"],
          fax: "+380442300901",
          email: "www.mcdonalds.ua",
          webPage: "info@ua.mcd.com",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "42496462",
        role: 5,
        address: {
          zip: "46009",
          country: "Україна",
          address:
            "Україна, 46009, Тернопільська обл., місто Тернопіль, ВУЛИЦЯ ГЕТЬМАНА  І. МАЗЕПИ, будинок 30",
          parts: {
            atu: "Тернопільська обл., місто Тернопіль",
            street: "ВУЛИЦЯ ГЕТЬМАНА  І. МАЗЕПИ",
            house: "30",
            houseType: "будинок",
            atuCode: "6110100000",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У МІСТІ ТЕРНОПІЛЬ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380442300900"],
          email: "info@ua.mcd.com",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "85.32",
            name: "Професійно-технічна освіта",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "42509675",
        role: 5,
        address: {
          zip: "08131",
          country: "Україна",
          address:
            "Україна, 08131, Київська обл., Києво-Святошинський р-н, село Софіївська Борщагівка, ВУЛИЦЯ КИЇВСЬКА, будинок 2",
          parts: {
            atu: "Київська обл., Києво-Святошинський р-н, село Софіївська Борщагівка",
            street: "ВУЛИЦЯ КИЇВСЬКА",
            house: "2",
            houseType: "будинок",
            atuCode: "3222486201",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У КИЇВСЬКІЙ ОБЛАСТІ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380442300900"],
          email: "info@ua.mcd.com",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "85.32",
            name: "Професійно-технічна освіта",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "43163851",
        role: 5,
        address: {
          zip: "81130",
          country: "Україна",
          address:
            "Україна, 81130, Львівська обл., Пустомитівський р-н, село Сокільники, ВУЛИЦЯ СТРИЙСЬКА, будинок 30 А",
          parts: {
            atu: "Львівська обл., Пустомитівський р-н, село Сокільники",
            street: "ВУЛИЦЯ СТРИЙСЬКА",
            house: "30 А",
            houseType: "будинок",
            atuCode: "4623686401",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" У ЛЬВІВСЬКІЙ ОБЛАСТІ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380442300900"],
          email: "info@ua.mcd.com",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "85.32",
            name: "Професійно-технічна освіта",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
        ],
      },
      {
        code: "43381083",
        role: 5,
        address: {
          zip: "67571",
          country: "Україна",
          address:
            "Україна, 67571, Одеська обл., Лиманський р-н, сільрада Фонтанська, КОМПЛЕКС БУДІВЕЛЬ ТА СПОРУД № 1",
          parts: {
            atu: "Одеська обл., Лиманський р-н, сільрада Фонтанська",
            street: "КОМПЛЕКС БУДІВЕЛЬ ТА СПОРУД № 1",
            atuCode: "5122786400",
          },
        },
        name: 'ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ ПІДПРИЄМСТВА З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД" В ОДЕСЬКІЙ ОБЛАСТІ',
        heads: [
          {
            role: 3,
            roleText: "керівник",
            lastName: "БАДРІТДІНОВА",
            firstMiddleName: "ЮЛІЯ ІВАНІВНА",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+380442300900"],
          email: "info@ua.mcd.com",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "85.32",
            name: "Професійно-технічна освіта",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
        ],
      },
      {
        code: "44259570",
        role: 5,
        address: {
          zip: "76003",
          country: "Україна",
          address:
            "Україна, 76003, Івано-Франківська обл., місто Івано-Франківськ(з), вул.Миколайчука Івана, будинок 2",
          parts: {
            atu: "Івано-Франківська обл., місто Івано-Франківськ(з)",
            street: "вул.Миколайчука Івана",
            house: "2",
            houseType: "будинок",
            atuCode: "2610100000",
          },
        },
        name: 'Відокремлений підрозділ Підприємства з іноземними інвестиціями "МакДональдз Юкрейн Лтд" в Івано-Франківській області',
        heads: [
          {
            role: 3,
            position: "керівник",
            roleText: "керівник",
            lastName: "Бадрітдінова",
            appointmentDate: "2021-03-29",
            firstMiddleName: "Юлія Іванівна",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+38(044)-230-09-00", "+38(044)-230-09-03"],
          fax: "+38(044)-230-09-01",
          email: "info@ua.mcd.com",
          webPage: "www.mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
          {
            code: "85.32",
            name: "Професійно-технічна освіта",
            isPrimary: false,
          },
        ],
      },
      {
        code: "44232543",
        role: 5,
        address: {
          zip: "29015",
          country: "Україна",
          address:
            "Україна, 29015, Хмельницька обл., місто Хмельницький(з), вул.Старокостянтинівське шосе, будинок 6-А",
          parts: {
            atu: "Хмельницька обл., місто Хмельницький(з)",
            street: "вул.Старокостянтинівське шосе",
            house: "6-А",
            houseType: "будинок",
            atuCode: "6810100000",
          },
        },
        name: 'Відокремлений підрозділ Підприємства з іноземними інвестиціями "МакДональдз Юкрейн Лтд" в Хмельницькій області',
        heads: [
          {
            role: 3,
            position: "керівник",
            roleText: "керівник",
            lastName: "Бадрітдінова",
            firstMiddleName: "Юлія Іванівна",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+38(050)-230-09-09", "+38(066)-230-09-00"],
          email: "info@ua.mcd.com",
          webPage: "www.mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
          {
            code: "85.32",
            name: "Професійно-технічна освіта",
            isPrimary: false,
          },
        ],
      },
      {
        code: "44339425",
        role: 5,
        address: {
          zip: "43024",
          country: "Україна",
          address:
            "Україна, 43024, Волинська обл., місто Луцьк(з), пр.Соборності, будинок 43",
          parts: {
            atu: "Волинська обл., місто Луцьк(з)",
            street: "пр.Соборності",
            house: "43",
            houseType: "будинок",
            atuCode: "0710100000",
          },
        },
        name: 'Відокремлений підрозділ Підприємства з іноземними інвестиціями "МакДональдз Юкрейн Лтд" в Волинській області',
        heads: [
          {
            role: 3,
            position: "керівник",
            roleText: "керівник",
            lastName: "Бадрітдінова",
            firstMiddleName: "Юлія Іванівна",
          },
        ],
        type: "610",
        contacts: {
          tel: ["+38(044)-230-09-00", "+38(044)-230-09-03"],
          email: "info@ua.mcd.com",
          webPage: "www.mcdonalds.ua",
        },
        roleText: "відокремлений підрозділ",
        typeText: "ФІЛІЯ (ІНШИЙ ВІДОКРЕМЛЕНИЙ ПІДРОЗДІЛ)",
        activityKinds: [
          {
            code: "11.07",
            name: "Виробництво безалкогольних напоїв; виробництво мінеральних вод та інших вод, розлитих у пляшки",
            isPrimary: false,
          },
          {
            code: "10.52",
            name: "Виробництво морозива",
            isPrimary: false,
          },
          {
            code: "46.39",
            name: "Неспеціалізована оптова торгівля продуктами харчування, напоями та тютюновими виробами",
            isPrimary: false,
          },
          {
            code: "47.19",
            name: "Інші види роздрібної торгівлі в неспеціалізованих магазинах",
            isPrimary: false,
          },
          {
            code: "56.10",
            name: "Діяльність ресторанів, надання послуг мобільного харчування",
            isPrimary: true,
          },
          {
            code: "68.20",
            name: "Надання в оренду й експлуатацію власного чи орендованого нерухомого майна",
            isPrimary: false,
          },
          {
            code: "85.32",
            name: "Професійно-технічна освіта",
            isPrimary: false,
          },
        ],
      },
    ],
    address: {
      zip: "02140",
      country: "Україна",
      address: "Україна, 02140, місто Київ, ВУЛИЦЯ ГРИШКА, будинок 7",
      parts: {
        atu: "місто Київ",
        street: "ВУЛИЦЯ ГРИШКА",
        house: "7",
        houseType: "будинок",
        atuCode: "8036300000",
      },
    },
    state: 1,
    management: "ВИЩИЙ - ЗБОРИ УЧАСНИКІВ, ВИКОНАВЧИЙ - ГЕНЕРАЛЬНИЙ ДИРЕКТОР",
    registration: {
      date: "1995-12-05",
      recordNumber: "10651200000000716",
      recordDate: "2004-09-27",
      isSeparation: false,
      isDivision: false,
      isMerge: false,
      isTransformation: false,
    },
    fullName: 'ПІДПРИЄМСТВО З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД"',
    shortName: 'ПІІ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД"',
    fullNameEn: "",
    primaryActivity:
      "56.10 Діяльність ресторанів, надання послуг мобільного харчування",
    ceoName: "Бадрітдінова Юлія Іванівна",
    registrationDate: "1995-12-05",
    lastTime: "2022-05-21 18:08:23",
    olfCode: "170",
    olfName: "ІНОЗЕМНЕ ПІДПРИЄМСТВО",
    foundingDocument: "Статут",
    executivePower: [],
    objectName: "Дарницька районна в місті Києві державна адміністрація",
  },
  factors: [
    {
      factorGroup: "tax",
      icon: "✅",
      indicator: "positive",
      number: "237444526652",
      status: "active",
      text: "Платник ПДВ",
      type: "vat",
      specificText: "Платник ПДВ, ІПН платника 237444526652",
      databaseDate: "2022-05-20",
      dateStart: "1997-07-15",
    },
    {
      factorGroup: "tax",
      government: 27474.1,
      icon: "⚠️",
      indicator: "warning",
      local: 0,
      text: "Податковий борг на 01.01.2022 — 27 474.1 грн\n",
      total: 27474.1,
      type: "debt",
    },
    {
      count: 103,
      factorGroup: "court",
      icon: "⚠️",
      indicator: "warning",
      link: "https://opendatabot.com/api/v2/court?company_code=23744453&apiKey=APUANQHS9Xnz",
      text: "Судовий реєстр — 103 рішення",
      type: "courtDecision",
    },
    {
      count: 24,
      factorGroup: "court",
      icon: "⚠️",
      indicator: "warning",
      items: [
        {
          type: "civil",
          count: 5,
          text: "Цивільні",
          link: "https://opendatabot.com/api/v2/company-courts/civil?code=23744453&apiKey=APUANQHS9Xnz",
          liveCount: 1,
        },
        {
          type: "criminal",
          count: 5,
          text: "Криминальні",
          link: "https://opendatabot.com/api/v2/company-courts/criminal?code=23744453&apiKey=APUANQHS9Xnz",
          liveCount: 0,
        },
        {
          type: "arbitrage",
          count: 1,
          text: "Господарські",
          link: "https://opendatabot.com/api/v2/company-courts/arbitrage?code=23744453&apiKey=APUANQHS9Xnz",
          liveCount: 0,
        },
        {
          type: "administrative",
          count: 10,
          text: "Адміністративні",
          link: "https://opendatabot.com/api/v2/company-courts/administrative?code=23744453&apiKey=APUANQHS9Xnz",
          liveCount: 0,
        },
        {
          type: "undefined",
          count: 3,
          text: "Категорію не визначено",
          link: "https://opendatabot.com/api/v2/company-courts/undefined?code=23744453&apiKey=APUANQHS9Xnz",
          liveCount: 0,
        },
      ],
      text: "Судові процеси компанії",
      type: "courtCompany",
    },
    {
      factorGroup: "edr",
      items: [
        {
          date: "2021-04-05",
          changes: [
            {
              field: "beneficiary",
              record: "delete",
              text: "видалений бенефіціарний власник",
              oldValue:
                'ЮРИДИЧНОЇ ОСОБИ (КОМПАНІЯ "ЕМСІДІ ЮРОП ЛІМІТЕД")  ВІДСУТНІЙ (ВІДСУТНІ ОСОБИ',
            },
          ],
        },
        {
          date: "2019-04-01",
          changes: [
            {
              field: "ceo_name",
              record: "update",
              text: "змінився керівник",
              newValue: "Бадрітдінова Юлія Іванівна",
              oldValue: "Хмелярський Гжегож Мацей",
            },
          ],
        },
        {
          date: "2018-09-14",
          changes: [
            {
              field: "beneficiary",
              record: "delete",
              text: "видалений бенефіціарний власник",
              oldValue:
                'КОМПАНІЯ "ГОЛДЕН АЧІЗ ЮРОПІАН ХОЛДІНГС Б.В." (GOLDEN ARCHES EUROPEAN HOLDINGS B.V.)',
            },
            {
              field: "beneficiary",
              record: "delete",
              text: "видалений бенефіціарний власник",
              oldValue:
                'КОМПАНІЯ "ГЛОУБАЛ РЕСТОРАНТ ОПЕРЕЙШНЗ ОВ АЄЛЕНД ЛІМІТЕД" (GLOBAL RESTAURANT OPERATIONS OF IRELAND LIMITED)',
            },
          ],
        },
      ],
      text: "Змін реєстраційної інформації — 3",
      type: "history",
    },
  ],
  financialStatement: [
    {
      year: 2020,
      revenue: 7872017000,
      expenses: 3473389000,
      profit: 714904000,
      nonCurrentAssets: 2298940000,
      currentAssets: 1183638000,
      liability: 921482000,
      balance: 3482578000,
      sector: "nongovernment",
    },
  ],
};

export const companyListMock = [
  {
    code: 23744453,
    field: "full_name",
    value: 'ПІДПРИЄМСТВО З ІНОЗЕМНИМИ ІНВЕСТИЦІЯМИ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД"',
    actualDate: "2022-05-21 18:08:23",
  },
  {
    code: 36177441,
    field: "full_name",
    value:
      'ПЕРВИННА ПРОФСПІЛКОВА ОРГАНІЗАЦІЯ ВСЕУКРАЇНСЬКОЇ ПРОФЕСІЙНОЇ СПІЛКИ "ЗАХИСТ СПРАВЕДЛИВОСТІ" ПРАЦІВНИКІВ ППІ "МАКДОНАЛЬДЗ ЮКРЕЙН ЛТД"',
    actualDate: "2022-05-06 11:42:51",
  },
];
